1. Understand prob statement
2. identify problem like regg,classi,clustering.
3. understant the data
   - eda: in eda only we know how good is our data how to preprocess it and all.
4. preprocessing
   - data cleaing
   - outlier treatment
   - label encoding
   - etc
5. scaling data
6. checking correlation
7. prediction
8. model evaluation
9. hyper parameter tuning

In [2]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')
import matplotlib.pyplot as plt
#%matplotlib inline

In [5]:
pip install openpyxl --upgrade

Collecting openpyxl
  Using cached openpyxl-3.1.2-py2.py3-none-any.whl.metadata (2.5 kB)
Collecting et-xmlfile (from openpyxl)
  Downloading et_xmlfile-1.1.0-py3-none-any.whl.metadata (1.8 kB)
Using cached openpyxl-3.1.2-py2.py3-none-any.whl (249 kB)
Using cached et_xmlfile-1.1.0-py3-none-any.whl (4.7 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-1.1.0 openpyxl-3.1.2
Note: you may need to restart the kernel to use updated packages.

In [6]:
df=pd.read_excel('data_preprocessing.xlsx')

In [7]:
df.head()

  Dept   Age Experience   Salary       Education  Projects
0   HR  32.0          9  40000.0  Under_Graduate       0.0
1   HR  33.0         12  48000.0          Master       0.0
2   IT  35.0         12  45000.0          Master       5.0
3   IT   NaN         12  46000.0        Graduate       5.0
4   HR  34.0         11      NaN        Graduate       2.0

In [9]:
df.tail(2)

         Dept   Age Experience   Salary Education  Projects
31  Marketing  75.0         50  39000.0    Master       1.0
32         HR   NaN         11  42000.0         ?       2.0

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 33 entries, 0 to 32
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Dept        31 non-null     object
 1   Age         30 non-null     float64
 2   Experience  29 non-null     object
 3   Salary      31 non-null     float64
 4   Education   31 non-null     object
 5   Projects    27 non-null     float64
dtypes: float64(3), object(3)
memory usage: 1.7+ KB

In [12]:
df.describe()

             Age        Salary   Projects
count  30.000000     31.000000  27.000000
mean   37.333333  41983.870968   2.148148
std    18.690461  15998.168578   1.261980
min     0.000000  20000.000000   0.000000
25%    29.500000  35500.000000   1.000000
50%    34.500000  42000.000000   2.000000
75%    48.750000  45250.000000   3.000000
max    75.000000  90000.000000   5.000000

In [13]:
df.describe(include='O')

       Dept  Experience Education
count    31          29        31
unique    4          15         5
top      HR          12    Master
freq     13           6        12

In [19]:
df.isnull().mean() * 100
# % missing values

Dept           6.060606
Age            9.090909
Experience    12.121212
Salary         6.060606
Education      6.060606
Projects      18.181818
dtype: float64

In [20]:
df.isnull().sum().sum()
# total no of missing values.

19

In [21]:
df1=df.copy()

In [22]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 33 entries, 0 to 32
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Dept        31 non-null     object
 1   Age         30 non-null     float64
 2   Experience  29 non-null     object
 3   Salary      31 non-null     float64
 4   Education   31 non-null     object
 5   Projects    27 non-null     float64
dtypes: float64(3), object(3)
memory usage: 1.7+ KB

In [23]:
df1.Age=df1.Age.fillna(df1.Age.mean())

In [28]:
df1.Salary=df1.Salary.fillna(df1.Salary.median())
df1.Experience=df1.Experience.replace('.',np.nan).replace('%',np.nan).replace('a',np.nan)
df1.Experience=df1.Experience.astype('float')
df1.Experience=df1.Experience.fillna(df1.Experience.median())

In [32]:
df1.Projects=df1.Projects.fillna(df1.Projects.median())

In [40]:
df1.Dept=df1.Dept.fillna(df1.Dept.mode()[0])

In [43]:
df1.Education=df1.Education.replace('a',np.nan).replace('?',np.nan)
df1.Education=df1.Education.fillna(df1.Education.mode()[0])

In [44]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 33 entries, 0 to 32
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Dept        33 non-null     object
 1   Age         33 non-null     float64
 2   Experience  33 non-null     float64
 3   Salary      33 non-null     float64
 4   Education   33 non-null     object
 5   Projects    33 non-null     float64
dtypes: float64(4), object(2)
memory usage: 1.7+ KB